Revit 2027 API
MEPNetworkSegmentData.FrictionFactor Property
 The calculated friction factor of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FrictionFactor { get; }
Public ReadOnly Property FrictionFactor As Double
	Get
public:
property double FrictionFactor {
	double get ();
}
member FrictionFactor : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace